Учет_ФК/src/Documents/ПередачаПродукцииВПереработку/ПередачаПродукцииВПереработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПередачаПродукцииВПереработку</name>
  <registerRecords>AccumulationRegister.ПереработкаПродукции</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПродукцииНаСкладе</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаРаботы</name>
    <type>
      <types>CatalogRef.СменыРаботы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>ТранспортировочноеМесто</name>
      <type>
        <types>CatalogRef.ТранспортировочныеМеста</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияПродукции</name>
      <type>
        <types>CatalogRef.ПартииПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесБруттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПломбы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_ФК/src/Documents/ФормированиеПартийПродукцииДляПереработки/ФормированиеПартийПродукцииДляПереработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФормированиеПартийПродукцииДляПереработки</name>
  <registerRecords>InformationRegister.ДанныеПодготовкиКПереработке</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПартииПереработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>ТранспортировочноеМесто</name>
      <type>
        <types>CatalogRef.ТранспортировочныеМеста</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияПродукции</name>
      <type>
        <types>CatalogRef.ПартииПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесБруттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПломбы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерМестаВПартии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_ФК/src/Documents/ПередачаПродукцииВПереработку/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Функция ПолучитьПараметрыПодбора(ИмяТаблицы)
	
	ДатаРасчетов 	 = ?(НачалоДня(Объект.Дата) = НачалоДня(ТекущаяДата()), Неопределено, Объект.Дата);
	
	ЗаголовокПодбора = НСтр("ru = 'Подбор транспортировочных мест в %1 (%2)'");
	ПредставлениеТаблицы = НСтр("ru = 'Список продукции'");
	ЗаголовокПодбора = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ЗаголовокПодбора, Объект.Ссылка, НСтр("ru = 'Список продукции'"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЕстьКоличество", Истина);
	ПараметрыФормы.Вставить("ДатаРасчетов"  , ДатаРасчетов);
	ПараметрыФормы.Вставить("Склад"         , Объект.Склад);
	ПараметрыФормы.Вставить("Заголовок"     , ЗаголовокПодбора);
	ПараметрыФормы.Вставить("ВидПодбора"    , ПолучитьВидПодбора(ИмяТаблицы));
	ПараметрыФормы.Вставить("ИмяТаблицы"    , ИмяТаблицы);
	ПараметрыФормы.Вставить("Организация"   ,Объект.Организация);
	ПараметрыФормы.Вставить("ПоказыватьОстатки"  , Истина);
	
	Возврат ПараметрыФормы;
КонецФункции

&НаКлиенте
Функция ПолучитьВидПодбора(ИмяТаблицы)
	
	ВидПодбора = "";
	
	Возврат ВидПодбора;
	
КонецФункции

&НаКлиенте
Процедура Подбор(Команда)
	ПараметрыПодбора = ПолучитьПараметрыПодбора("Продукция");
	Если ПараметрыПодбора <> Неопределено Тогда
		ОткрытьФорму("Обработка.ПодборТранспортировочногоМеста.Форма.Форма", ПараметрыПодбора, ЭтотОбъект, УникальныйИдентификатор);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборТранспортировочногоМеста.Форма.Форма" Тогда
		ОбработкаВыбораПодборВставкаИзБуфераНаСервере(ВыбранноеЗначение, ИсточникВыбора.ИмяТаблицы);
	КонецЕсли;
	
	Если ИсточникВыбора.ИмяФормы = "Документ.ФормированиеПартийПродукцииДляПереработки.ФормаВыбора" Тогда 
		СтруктураПоиска  = Новый Структура();
		СтруктураПоиска.Вставить("ДокуменФормированияПартииПереработки",ВыбранноеЗначение);
		ДобавитьСтрокуДокументаНаСервере(СтруктураПоиска);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуДокументаНаСервере(СтруктураДанных)
	Если ЗначениеЗаполнено(СтруктураДанных.ДокуменФормированияПартииПереработки) Тогда
		Для каждого СтрокаИсточник из СтруктураДанных.ДокуменФормированияПартииПереработки.Продукция Цикл
			СтруктураПоиска = новый Структура;
			СтруктураПоиска.Вставить("ПартияПродукции"			,СтрокаИсточник.ПартияПродукции);
			СтруктураПоиска.Вставить("ТранспортировочноеМесто"	,СтрокаИсточник.ТранспортировочноеМесто);
			
			НайденныеСтроки = Объект.Продукция.НайтиСтроки(СтруктураПоиска);
			
			Если НайденныеСтроки.Количество() = 0 Тогда 
				НоваяСтрока = Объект.Продукция.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаИсточник);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораПодборВставкаИзБуфераНаСервере(ВыбранноеЗначение, ИмяТаблицы)

	ТаблицаДанных = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресПодобранныхПозицийВХранилище);
	
	Для каждого СтрокаДанных из ТаблицаДанных Цикл 
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ТранспортировочноеМесто",СтрокаДанных.ТранспортировочноеМесто);
		СтруктураПоиска.Вставить("ПартияПродукции",СтрокаДанных.ПартияПродукции);
		массивНайденныхСтрок = Объект.Продукция.НайтиСтроки(СтруктураПоиска);
		
		Если массивНайденныхСтрок.Количество() <> 0 Тогда 
			//такое место в документе уже есть, повторно не добавляем
			Продолжить;			
		КонецЕсли;
		НовСтрока = Объект.Продукция.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока,СтрокаДанных,,"НомерСтроки");
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ПродукцияПодбор.Доступность = Не ЭтаФорма.ТолькоПросмотр;
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьИзПартииПереработки(Команда)
	
	Если ЗначениеЗаполнено(Объект.Склад) Тогда
		параметрыФормы = Новый Структура;
		параметрыФормы.Вставить("СкладПолучатель"	,Объект.Склад);
		параметрыФормы.Вставить("Организация"		,Объект.Организация);
		параметрыФормы.Вставить("РежимВыбора"		,Истина);
		параметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца"		,Истина);
		параметрыФормы.Вставить("ЗакрыватьПриВыборе"		,Ложь);
		ФормаВыбора = ПолучитьФорму("Документ.ФормированиеПартийПродукцииДляПереработки.ФормаВыбора",параметрыФормы,ЭтаФорма,,,);	
		ФормаВыбора.Открыть();
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "Склад";
		Сообщение.ПутьКДанным = "Объект.Склад";
		Сообщение.Текст = "В документе не указан склад, подбор не возможен";
		Сообщение.Сообщить();
	КонецЕсли;
	
	
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
